# PDS Lab 5: üêº
##### Import necessary modules

In [1]:
import json

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime, timedelta

##### Set pandas defaults

In [2]:
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', 50)

## Welcome to Pandas DataFrames!

In [3]:
print("Pandas version:", pd.__version__)

Pandas version: 1.5.3

### What is a DataFrame?
A DataFrame is a 2-dimensional labeled data structure with columns of potentially 
different types. You can think of it like:
- a spreadsheet
- a SQL table
- a dict of Series objects.

### 1. Creating DataFrames from different sources
**a. From a dictionary:**

In [4]:
data_dict = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Sydney'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
}

In [5]:
df = pd.DataFrame(data_dict)
df

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Tokyo   70000
3    Diana   28     Paris   55000
4      Eve   32    Sydney   65000

**b. From a list:**

In [6]:
data_list = [
    ['Alice', 25, 'New York', 50000],
    ['Bob', 30, 'London', 60000],
    ['Charlie', 35, 'Tokyo', 70000],
    ['Diana', 28, 'Paris', 55000],
    ['Eve', 32, 'Sydney', 65000]
]

In [7]:
df = pd.DataFrame(data_list, columns=["Name","Age","City","Salary"])
df

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Tokyo   70000
3    Diana   28     Paris   55000
4      Eve   32    Sydney   65000

### 2. Basic DataFrame properties and methods
**a. Number of rows and columns.**

In [8]:
df.shape

(5, 4)

**b. Columns.**

In [9]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

**c. Data types.**

In [10]:
df.dtypes

Name      object
Age        int64
City      object
Salary     int64
dtype: object

**d. First rows.**

In [11]:
df.head()

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Tokyo   70000
3    Diana   28     Paris   55000
4      Eve   32    Sydney   65000

**e. Last rows.**

In [12]:
df.tail()

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Tokyo   70000
3    Diana   28     Paris   55000
4      Eve   32    Sydney   65000

### 3. DataFrame indexing and selection
**a. Single column selection.**

In [13]:
df[["Name"]]

      Name
0    Alice
1      Bob
2  Charlie
3    Diana
4      Eve

**b. Multiple column selection.**

In [14]:
df[["Name","Age"]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    Diana   28
4      Eve   32

**c. Select first row by index.**

In [15]:
df.iloc[0] # ‚â† from .loc (iloc includes the index)

Name         Alice
Age             25
City      New York
Salary       50000
Name: 0, dtype: object

**c. Select first three rows by index.**

In [16]:
df.iloc[0:3]

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Tokyo   70000

In [17]:
# Select last three rows by index.
df.iloc[-3:]

      Name  Age    City  Salary
2  Charlie   35   Tokyo   70000
3    Diana   28   Paris   55000
4      Eve   32  Sydney   65000

### 4. Saving Files

In [18]:
sample_csv_data = """Name,Age,Department,Salary,Join_Date
John Doe,28,Engineering,75000,2020-01-15
Jane Smith,32,Marketing,65000,2019-03-22
Mike Johnson,45,Engineering,85000,2018-07-10
Sarah Wilson,29,HR,55000,2021-05-03
Tom Brown,38,Finance,70000,2017-11-28
Lisa Davis,26,Marketing,60000,2022-02-14
"""

In [19]:
sample_json_data = [
    {"product_id": 1, "product_name": "Laptop", "price": 999.99, "category": "Electronics"},
    {"product_id": 2, "product_name": "Chair", "price": 199.99, "category": "Furniture"},
    {"product_id": 3, "product_name": "Book", "price": 29.99, "category": "Education"},
    {"product_id": 4, "product_name": "Phone", "price": 699.99, "category": "Electronics"}
]

**a. Save sample_csv_data to CSV file.**

In [20]:
with open("sample_csv_data.csv", "w") as f:
    f.write(sample_csv_data)

**b. Save sample_json_data to a JSON file.**

In [21]:
with open("sample_json_data.json", "w") as f:
    json.dump(sample_json_data,f)

### 5. Reading Files
**a. Read the CSV file and print the column types.**

In [22]:
products_df = pd.read_csv('sample_csv_data.csv')
print(products_df.dtypes)

Name          object
Age            int64
Department    object
Salary         int64
Join_Date     object
dtype: object

**b. Read the CSV file with date parsing and specifying an index column. Print the column types.**

In [30]:
employees_df = pd.read_csv('sample_csv_data.csv',index_col="Name", parse_dates=["Join_Date"])
print(products_df.dtypes)

Age                    int64
Department            object
Salary                 int64
Join_Date     datetime64[ns]
dtype: object

**c. Read the JSON file.**

In [31]:
pd.read_json("sample_json_data.json")

   product_id product_name   price     category
0           1       Laptop  999.99  Electronics
1           2        Chair  199.99    Furniture
2           3         Book   29.99    Education
3           4        Phone  699.99  Electronics

### 6. Basic Queries and Filtering
**a. Print the employees DataFrame.**

In [32]:
employees_df

              Age   Department  Salary  Join_Date
Name
John Doe       28  Engineering   75000 2020-01-15
Jane Smith     32    Marketing   65000 2019-03-22
Mike Johnson   45  Engineering   85000 2018-07-10
Sarah Wilson   29           HR   55000 2021-05-03
Tom Brown      38      Finance   70000 2017-11-28
Lisa Davis     26    Marketing   60000 2022-02-14

**b. Filter the DataFrame such that only salaries above 65K are shown.**

In [38]:
employees_df[employees_df['Salary'] > 65000]

              Age   Department  Salary  Join_Date
Name
John Doe       28  Engineering   75000 2020-01-15
Mike Johnson   45  Engineering   85000 2018-07-10
Tom Brown      38      Finance   70000 2017-11-28

**c. Filter the DataFrame such that only the Engineering department and salaries above 70K are shown.**

In [39]:
employees_df[(employees_df['Department'] == 'Engineering') & (employees_df['Salary'] > 70000)]

              Age   Department  Salary  Join_Date
Name
John Doe       28  Engineering   75000 2020-01-15
Mike Johnson   45  Engineering   85000 2018-07-10

**d. Repeat the previous exercise but using the query() method.**

In [40]:
employees_df.query("Department == 'Engineering' and Salary > 70000")

              Age   Department  Salary  Join_Date
Name
John Doe       28  Engineering   75000 2020-01-15
Mike Johnson   45  Engineering   85000 2018-07-10

**e. Using string contains filter the DataFrame such that only rows where the department is Marketing are shown.**

In [41]:
employees_df[employees_df['Department'].str.contains('Marketing')]

            Age Department  Salary  Join_Date
Name
Jane Smith   32  Marketing   65000 2019-03-22
Lisa Davis   26  Marketing   60000 2022-02-14

**f. Filter the DataFrame such that only the Engineering and Marketing departments are shown.**

In [56]:
employees_df[(employees_df['Department'].isin(['Engineering','Marketing']))] #or
employees_df.query(" Department == 'Engineering' or Department == 'Marketing' ")

              Age   Department  Salary  Join_Date
Name
John Doe       28  Engineering   75000 2020-01-15
Jane Smith     32    Marketing   65000 2019-03-22
Mike Johnson   45  Engineering   85000 2018-07-10
Lisa Davis     26    Marketing   60000 2022-02-14

### 7. Group By Operations
**a. Get the average salary by department.**

In [57]:
employees_df.groupby('Department')['Salary'].mean()

Department
Engineering    80000.0
Finance        70000.0
HR             55000.0
Marketing      62500.0
Name: Salary, dtype: float64

**b. Count the number of employees by department.**

In [58]:
employees_df.groupby('Department').size()

Department
Engineering    2
Finance        1
HR             1
Marketing      2
dtype: int64

**c. Get the average, min, and max for salary and age, by deparment.**

In [59]:
employees_df.groupby('Department')[['Salary', 'Age']].agg(['mean', 'min', 'max'])

              Salary                 Age
                mean    min    max  mean min max
Department
Engineering  80000.0  75000  85000  36.5  28  45
Finance      70000.0  70000  70000  38.0  38  38
HR           55000.0  55000  55000  29.0  29  29
Marketing    62500.0  60000  65000  29.0  26  32

**d. Get the range of salaries by department.**

In [66]:
employees_df.groupby('Department')['Salary'].max() - employees_df.groupby('Department')['Salary'].min() #or
employees_df.groupby('Department')['Salary'].apply(lambda x: x.max()-x.min())

Department
Engineering    10000
Finance            0
HR                 0
Marketing       5000
Name: Salary, dtype: int64

**e. Create a new column "Age_Group" by splitting the age in the bins [0, 30, 40, 100]. Name each bin "Young", "Middle", and "Senior".**

In [72]:
employees_df['Age_Group']=pd.cut(employees_df['Age'], bins=[0, 30, 40, 100], labels=["Young", "Middle","Senior"])
employees_df

              Age   Department  Salary  Join_Date Age_Group
Name
John Doe       28  Engineering   75000 2020-01-15     Young
Jane Smith     32    Marketing   65000 2019-03-22    Middle
Mike Johnson   45  Engineering   85000 2018-07-10    Senior
Sarah Wilson   29           HR   55000 2021-05-03     Young
Tom Brown      38      Finance   70000 2017-11-28    Middle
Lisa Davis     26    Marketing   60000 2022-02-14     Young

**f. Get the mean salary per Department and Age Group.**

In [74]:
employees_df.groupby(['Department','Age_Group'])['Salary'].mean()

Department   Age_Group
Engineering  Young        75000.0
             Middle           NaN
             Senior       85000.0
Finance      Young            NaN
             Middle       70000.0
             Senior           NaN
HR           Young        55000.0
             Middle           NaN
             Senior           NaN
Marketing    Young        60000.0
             Middle       65000.0
             Senior           NaN
Name: Salary, dtype: float64

**g. Get the average age by deparment for those whose Salary > 60K. Do this with method chaining.**

In [82]:
employees_df.query("Salary>60000").groupby('Department')['Age'].mean()

Department
Engineering    36.5
Finance        38.0
Marketing      32.0
Name: Age, dtype: float64

### 8. Joining Data

In [83]:
employees_detail = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John Doe', 'Jane Smith', 'Mike Johnson', 'Sarah Wilson', 'Tom Brown'],
    'department_id': [1, 2, 1, 3, 4]
})

In [84]:
departments = pd.DataFrame({
    'department_id': [1, 2, 3, 4, 5],
    'department_name': ['Engineering', 'Marketing', 'HR', 'Finance', 'Operations'],
    'location': ['Building A', 'Building B', 'Building A', 'Building C', 'Building B']
})

In [85]:
employee_projects = pd.DataFrame({
    'emp_id': [1, 2, 3, 1, 2],
    'project': ['Project A', 'Project B', 'Project C', 'Project D', 'Project A'],
    'hours': [40, 35, 30, 25, 20]
})

In [86]:
df_missing = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, np.nan],
    'C': [1, 2, 3, np.nan, 5]
})

**a. Do an inner join of the employees_details and the departments dataframes.**

In [93]:
pd.merge(employees_detail,departments,how="inner",on="department_id")

   employee_id          name  department_id department_name    location
0            1      John Doe              1     Engineering  Building A
1            3  Mike Johnson              1     Engineering  Building A
2            2    Jane Smith              2       Marketing  Building B
3            4  Sarah Wilson              3              HR  Building A
4            5     Tom Brown              4         Finance  Building C

**b. Do a left join of the employees_details with the departments dataframes.**

In [92]:
pd.merge(employees_detail,departments,how="left",on="department_id")

   employee_id          name  department_id department_name    location
0            1      John Doe              1     Engineering  Building A
1            2    Jane Smith              2       Marketing  Building B
2            3  Mike Johnson              1     Engineering  Building A
3            4  Sarah Wilson              3              HR  Building A
4            5     Tom Brown              4         Finance  Building C

**c. Do a right join of the employees_details with the departments dataframes.**

In [89]:
pd.merge(employees_detail,departments,how="right",on="department_id")

   employee_id          name  department_id department_name    location
0          1.0      John Doe              1     Engineering  Building A
1          3.0  Mike Johnson              1     Engineering  Building A
2          2.0    Jane Smith              2       Marketing  Building B
3          4.0  Sarah Wilson              3              HR  Building A
4          5.0     Tom Brown              4         Finance  Building C
5          NaN           NaN              5      Operations  Building B

**d. Do an outer join of the employees_details with the departments dataframes.**

In [90]:
pd.merge(employees_detail,departments,how="outer",on="department_id")

   employee_id          name  department_id department_name    location
0          1.0      John Doe              1     Engineering  Building A
1          3.0  Mike Johnson              1     Engineering  Building A
2          2.0    Jane Smith              2       Marketing  Building B
3          4.0  Sarah Wilson              3              HR  Building A
4          5.0     Tom Brown              4         Finance  Building C
5          NaN           NaN              5      Operations  Building B

**e. Do an inner join of the employees_details with the employee_projects dataframes. Beware of the matching keys.**

In [96]:
pd.merge(employees_detail,employee_projects,how="inner",left_on="employee_id",right_on="emp_id")

   employee_id          name  department_id  emp_id    project  hours
0            1      John Doe              1       1  Project A     40
1            1      John Doe              1       1  Project D     25
2            2    Jane Smith              2       2  Project B     35
3            2    Jane Smith              2       2  Project A     20
4            3  Mike Johnson              1       3  Project C     30

### 9. Data Manipulation
In this section we will work with the df_work dataframe defined below.

In [108]:
df_work = employees_df.copy()
df_work = df_work.reset_index()

**a. Add a new column "Annual_Bonus" that is the Salary multiplied by 0.1. Print the Name, Salary and Annual_Bonus columns.**

In [109]:
df_work["Annual_Bonus"] = df_work["Salary"]*0.1
df_work[["Name","Salary","Annual_Bonus"]]

           Name  Salary  Annual_Bonus
0      John Doe   75000        7500.0
1    Jane Smith   65000        6500.0
2  Mike Johnson   85000        8500.0
3  Sarah Wilson   55000        5500.0
4     Tom Brown   70000        7000.0
5    Lisa Davis   60000        6000.0

**b. Add a column "Salary_Category" that takes the value "High" if the salary is greater than 70K, "Medium" if it is greater than 60K, and "Low" otherwise. Print the Name, Salary and Salary_Category columns.**

In [113]:
df_work["Salary_Category"] = df_work["Salary"].apply(lambda x: "High" if x > 70000 else "Medium" if x > 60000 else "Low")
df_work

,Name,Age,Department,Salary,Join_Date,Age_Group,Annual_Bonus,Salary_Category
0,John Doe,28,Engineering,75000,2020-01-15,Young,7500.0,High
1,Jane Smith,32,Marketing,65000,2019-03-22,Middle,6500.0,Medium
2,Mike Johnson,45,Engineering,85000,2018-07-10,Senior,8500.0,High
3,Sarah Wilson,29,HR,55000,2021-05-03,Young,5500.0,Low
4,Tom Brown,38,Finance,70000,2017-11-28,Middle,7000.0,Medium
5,Lisa Davis,26,Marketing,60000,2022-02-14,Young,6000.0,Low

**c. Add a column "Name_Upper" that is the contents of the Name column in uppercase.**

**d. Add a column "First_Name" which is the first name appearing in the "Name" column.**

### 10. Data Manipulation: Missing Data

In [ ]:
df_missing = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, np.nan],
    'C': [1, 2, 3, np.nan, 5]
})

**a. Check for missing values.**

**b. Drop the rows with missing values.**

**c. Fill the missing values. Use the method "ffill". What does it fill with?**

**d. Fill the missing values. Now use the method "ffill". What does it fill with?**

### 11. Sorting and Ranking
**a. Using the df_employees dataframe sort the values, in descending order, using the Salary column.**

**b. Using the df_employees dataframe sort the values by the Department and Age columns, in this order.**

**c. Create a new column in the df_employees dataframe that has the Salary rank in descending order.**

### 12. Reshaping with Pivot and Melt

In [ ]:
sales_data = pd.DataFrame({
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'Product': ['A', 'B', 'A', 'B'],
    'Sales': [100, 150, 120, 180]
})

**a. Create a new table pivot_sales by pivotting the sales_data DataFrame with "Date" as the index, "Product" as the columns and "Sales" as the values.**

**b. Unpivot the pivot_sales DataFrame.**

### 13. Saving Data
For the following questions use the df_employees DataFrame.

**a. Save the DataFrame as a csv. Beware of defining any additional arguments.**

**b. Save the DataFrame as a json. Beware of defining any additional arguments.**

**c. Save the columns "Name" and "Salary" from the DataFrame as a csv. Beware of defining any additional arguments.**

**d. Save the columns "Name", "Deparment", and "Salary" from the DataFrame as a csv. Don't store the index, and use "|" as the separator.**

### 14. Additional Operations
For the following questions use the df_employees DataFrame.

**a. Convert the column "Join_Date" into a datetime object.**

**b. Create a new column that corresponds to the number of years the employee has been employed.**

**c. Create a new column with the year of the Join_Date column.**

**d. Create a new column with the month of the Join_Date column.**

**e. Get the summary statistics for the "Age", "Salary", and "Years_Employed" columns.**

**f. Get the correlation matrix for the same columns as in e. Print the correlation matrix colored.**

**g. Print:**
- **shape**
- **number of duplicates**
- **number of missing values per column**
- **number of unique values in categorical columns.**

## ‚ö†Ô∏è PANDAS BEST PRACTICES AND PERFORMANCE TIPS: ‚ö†Ô∏è

1. Use vectorized operations instead of loops
2. Use .loc and .iloc for explicit indexing
3. Specify data types when reading files to save memory
4. Use categorical data types for repeated string values
5. Use query() for complex filtering
6. Chain operations using method chaining
7. Use groupby.agg() with dictionaries for multiple aggregations
8. Be careful with SettingWithCopyWarning - use .copy() when needed

## Additional Exercises
1. Find all employees who joined after 2020
2. Calculate the total salary cost by department
3. Find the oldest employee in each department
4. Create a new column showing salary as a percentage of the maximum salary
5. Create a pivot table showing average age by department and salary category

**Bonus:** 
- Create visualizations of your findings using matplotlib or seaborn [next class we will focus on this!]
- Combine employee data with external data (create your own sample data)

In [ ]:
# 1.

In [ ]:
# 2.

In [ ]:
# 3.

In [ ]:
# 4.

In [ ]:
# 5.

In [ ]:
# Cleanup created files
import os
files_to_remove = ['employees.csv', 'products.json', 'employees_output.csv', 
                  'employees_output.json', 'salary_report.csv', 'employees_custom.csv']
for file in files_to_remove:
    if os.path.exists(file):
        os.remove(file)
print("Sample files cleaned up.")